#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Mon Dec 20 17:51:29 2021
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 1 -waveform {0 0.5} -name vsysclk 
create_clock -period 1.5 -waveform {0 0.75} -name sysclk [get_ports clk]
group_path -name I2R -from [list [get_ports enable] [get_ports clk] [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}]]
group_path -name I2O -from [list [get_ports enable] [get_ports clk] [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}]]  -to [list [get_ports {C[0]}] [get_ports {C[1]}] [get_ports {C[2]}] [get_ports {C[3]}] [get_ports {C[4]}] [get_ports {C[5]}] [get_ports {C[6]}] [get_ports {C[7]}] [get_ports {C[8]}] [get_ports {C[9]}] [get_ports {C[10]}] [get_ports {C[11]}] [get_ports {C[12]}] [get_ports {C[13]}] [get_ports {C[14]}] [get_ports {C[15]}] [get_ports {C[16]}] [get_ports {C[17]}] [get_ports {C[18]}] [get_ports {C[19]}] [get_ports {C[20]}] [get_ports {C[21]}] [get_ports {C[22]}] [get_ports {C[23]}] [get_ports {C[24]}] [get_ports {C[25]}] [get_ports {C[26]}] [get_ports {C[27]}] [get_ports {C[28]}] [get_ports {C[29]}] [get_ports {C[30]}]]
group_path -name R2O -to [list [get_ports {C[0]}] [get_ports {C[1]}] [get_ports {C[2]}] [get_ports {C[3]}] [get_ports {C[4]}] [get_ports {C[5]}] [get_ports {C[6]}] [get_ports {C[7]}] [get_ports {C[8]}] [get_ports {C[9]}] [get_ports {C[10]}] [get_ports {C[11]}] [get_ports {C[12]}] [get_ports {C[13]}] [get_ports {C[14]}] [get_ports {C[15]}] [get_ports {C[16]}] [get_ports {C[17]}] [get_ports {C[18]}] [get_ports {C[19]}] [get_ports {C[20]}] [get_ports {C[21]}] [get_ports {C[22]}] [get_ports {C[23]}] [get_ports {C[24]}] [get_ports {C[25]}] [get_ports {C[26]}] [get_ports {C[27]}] [get_ports {C[28]}] [get_ports {C[29]}] [get_ports {C[30]}]]
set_load 10 [get_ports {C[30]}]
set_load 10 [get_ports {C[29]}]
set_load 10 [get_ports {C[28]}]
set_load 10 [get_ports {C[27]}]
set_load 10 [get_ports {C[26]}]
set_load 10 [get_ports {C[25]}]
set_load 10 [get_ports {C[24]}]
set_load 10 [get_ports {C[23]}]
set_load 10 [get_ports {C[22]}]
set_load 10 [get_ports {C[21]}]
set_load 10 [get_ports {C[20]}]
set_load 10 [get_ports {C[19]}]
set_load 10 [get_ports {C[18]}]
set_load 10 [get_ports {C[17]}]
set_load 10 [get_ports {C[16]}]
set_load 10 [get_ports {C[15]}]
set_load 10 [get_ports {C[14]}]
set_load 10 [get_ports {C[13]}]
set_load 10 [get_ports {C[12]}]
set_load 10 [get_ports {C[11]}]
set_load 10 [get_ports {C[10]}]
set_load 10 [get_ports {C[9]}]
set_load 10 [get_ports {C[8]}]
set_load 10 [get_ports {C[7]}]
set_load 10 [get_ports {C[6]}]
set_load 10 [get_ports {C[5]}]
set_load 10 [get_ports {C[4]}]
set_load 10 [get_ports {C[3]}]
set_load 10 [get_ports {C[2]}]
set_load 10 [get_ports {C[1]}]
set_load 10 [get_ports {C[0]}]
set_input_transition 0.1 [get_ports {A[15]}]
set_input_transition 0.1 [get_ports {A[14]}]
set_input_transition 0.1 [get_ports {A[13]}]
set_input_transition 0.1 [get_ports {A[12]}]
set_input_transition 0.1 [get_ports {A[11]}]
set_input_transition 0.1 [get_ports {A[10]}]
set_input_transition 0.1 [get_ports {A[9]}]
set_input_transition 0.1 [get_ports {A[8]}]
set_input_transition 0.1 [get_ports {A[7]}]
set_input_transition 0.1 [get_ports {A[6]}]
set_input_transition 0.1 [get_ports {A[5]}]
set_input_transition 0.1 [get_ports {A[4]}]
set_input_transition 0.1 [get_ports {A[3]}]
set_input_transition 0.1 [get_ports {A[2]}]
set_input_transition 0.1 [get_ports {A[1]}]
set_input_transition 0.1 [get_ports {A[0]}]
set_input_transition 0.1 [get_ports {B[15]}]
set_input_transition 0.1 [get_ports {B[14]}]
set_input_transition 0.1 [get_ports {B[13]}]
set_input_transition 0.1 [get_ports {B[12]}]
set_input_transition 0.1 [get_ports {B[11]}]
set_input_transition 0.1 [get_ports {B[10]}]
set_input_transition 0.1 [get_ports {B[9]}]
set_input_transition 0.1 [get_ports {B[8]}]
set_input_transition 0.1 [get_ports {B[7]}]
set_input_transition 0.1 [get_ports {B[6]}]
set_input_transition 0.1 [get_ports {B[5]}]
set_input_transition 0.1 [get_ports {B[4]}]
set_input_transition 0.1 [get_ports {B[3]}]
set_input_transition 0.1 [get_ports {B[2]}]
set_input_transition 0.1 [get_ports {B[1]}]
set_input_transition 0.1 [get_ports {B[0]}]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports enable]
set_input_delay 0.7 [get_ports {A[15]}]
set_input_delay 0.7 [get_ports {A[14]}]
set_input_delay 0.7 [get_ports {A[13]}]
set_input_delay 0.7 [get_ports {A[12]}]
set_input_delay 0.7 [get_ports {A[11]}]
set_input_delay 0.7 [get_ports {A[10]}]
set_input_delay 0.7 [get_ports {A[9]}]
set_input_delay 0.7 [get_ports {A[8]}]
set_input_delay 0.7 [get_ports {A[7]}]
set_input_delay 0.7 [get_ports {A[6]}]
set_input_delay 0.7 [get_ports {A[5]}]
set_input_delay 0.7 [get_ports {A[4]}]
set_input_delay 0.7 [get_ports {A[3]}]
set_input_delay 0.7 [get_ports {A[2]}]
set_input_delay 0.7 [get_ports {A[1]}]
set_input_delay 0.7 [get_ports {A[0]}]
set_input_delay 0.7 [get_ports {B[15]}]
set_input_delay 0.7 [get_ports {B[14]}]
set_input_delay 0.7 [get_ports {B[13]}]
set_input_delay 0.7 [get_ports {B[12]}]
set_input_delay 0.7 [get_ports {B[11]}]
set_input_delay 0.7 [get_ports {B[10]}]
set_input_delay 0.7 [get_ports {B[9]}]
set_input_delay 0.7 [get_ports {B[8]}]
set_input_delay 0.7 [get_ports {B[7]}]
set_input_delay 0.7 [get_ports {B[6]}]
set_input_delay 0.7 [get_ports {B[5]}]
set_input_delay 0.7 [get_ports {B[4]}]
set_input_delay 0.7 [get_ports {B[3]}]
set_input_delay 0.7 [get_ports {B[2]}]
set_input_delay 0.7 [get_ports {B[1]}]
set_input_delay 0.7 [get_ports {B[0]}]
set_input_delay 0.7 [get_ports clk]
set_input_delay 0.7 [get_ports enable]
set_output_delay 0.3 -clock vsysclk [get_ports {C[30]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[29]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[28]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[27]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[26]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[25]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[24]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[23]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[22]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[21]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[20]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[19]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[18]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[17]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[16]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[15]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[14]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[13]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[12]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[11]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[10]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[9]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[8]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[7]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[6]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[5]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[4]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[3]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[2]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[1]}]
set_output_delay 0.3 -clock vsysclk [get_ports {C[0]}]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
